Tekla Open API Reference for Tekla Structures 2025
IGeometryNode Methods
The IGeometryNode type exposes the following members.
Methods
Name | Description
AcceptVisitor
 Entry method for the visitor pattern
Clone
 Creates a new object that is a copy of the current instance.
Top
See Also
Reference
IGeometryNode Interface
Tekla.Structures.Model Namespace